In [1]:
import pandas as pd
import pyodbc

server = 'VENDAS' # substitua pelo nome do seu servidor 
database = 'Python' # substitua pelo nome do seu Banco de dados
conexaoDB = pyodbc.connect('DRIVER={ODBC DRIVER 17 for SQL Server};'
                           f'SERVER={server};'
                           f'DATABASE={database};'
                           'Trusted_Connection=yes;')
                           
                           
                           
cursor = conexaoDB.cursor() #criando cursor de comando

In [2]:
categoria = pd.read_sql('select * from categoria', conexaoDB) #executa tarefa de apagar dados
categoria.head(10)

C:\Users\supor\AppData\Local\Temp\ipykernel_11004\114157038.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  categoria = pd.read_sql('select * from categoria', conexaoDB) #executa tarefa de apagar dados

   ID                     NOME
0   0        Moda e Acessórios
1   1  Cosméticos e Perfumaria
2   2         Eletrodomésticos
3   3                   Livros
4   4                Celulares
5   5              Informática
6   6         Casa e Decoração
7   7              Eletrônicos
8   8          Esporte e Lazer
9   9       Brinquedos e Games

In [3]:
query = 'select  * FROM categoria'
categoria2 = pd.read_sql(query,conexaoDB)
categoria2.head(5)

C:\Users\supor\AppData\Local\Temp\ipykernel_11004\712191233.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  categoria2 = pd.read_sql(query,conexaoDB)

   ID                     NOME
0   0        Moda e Acessórios
1   1  Cosméticos e Perfumaria
2   2         Eletrodomésticos
3   3                   Livros
4   4                Celulares

In [4]:
query = " select first_name, last_name , cell_phone , state from clientes where state = 'São paulo'"
clientes = pd.read_sql(query,conexaoDB)
clientes.head(5)

C:\Users\supor\AppData\Local\Temp\ipykernel_11004\528160055.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  clientes = pd.read_sql(query,conexaoDB)

  first_name last_name   cell_phone      state
0      Frida    Mendes  9 5906-7552  São Paulo
1  Adalberto     Silva  9 1338-1447  São Paulo
2  Stephanie    Freire  9 3256-1853  São Paulo
3      Laura   Queiroz  9 6338-8617  São Paulo

In [7]:
query = ''' select first_name, last_name, cell_phone , email
 from clientes
 where email = 'Sem registro' '''

sem_email = pd.read_sql(query,conexaoDB)
sem_email.head

C:\Users\supor\AppData\Local\Temp\ipykernel_11004\720193871.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sem_email = pd.read_sql(query,conexaoDB)

<bound method NDFrame.head of    first_name    last_name   cell_phone         email
0       Marta        Jesus  9 9102-7834  Sem registro
1       Luana      Almeida  9 7328-8718  Sem registro
2     Romário     Teixeira  9 3093-6522  Sem registro
3     Marcelo      Barroso  9 2830-2088  Sem registro
4       James  Albuquerque  9 2430-5905  Sem registro
5      Heitor      Pereira  9 4839-8118  Sem registro
6       Maria        Pires  9 8229-1067  Sem registro
7     Marcelo       Mendes  9 6773-1560  Sem registro
8     Daniela         Lima  9 1763-2584  Sem registro
9     Willian      Freitas  9 3043-7382  Sem registro
10      Diego      Barboza  9 4849-7409  Sem registro
11      Marta        Abreu  9 9024-3467  Sem registro
12      Frida       Freire  9 4760-1383  Sem registro
13    Eduardo     Teixeira  9 2537-7930  Sem registro
14  Stephanie         Rosa  9 3040-4414  Sem registro>